**FREE 

// Return the ASP for an object
DCL-PR GetObjAsp CHAR(10);
    Library CHAR(10) CONST;
    Object  CHAR(10) CONST;
    ObjType CHAR(10) CONST;
END-PR;

